// Поканени сте от академията да напишете софтуер, който да пресмята точките за актьор/актриса. Академията ще ви даде първоначални точки за актьора. След това всеки оценяващ ще дава своята оценка. Точките, които актьора получава се формират от: дължината на името на оценяващия умножено по точките, които дава делено на две. 
// Ако резултатът в някой момент надхвърли 1250.5 програмата трябва да прекъсне и да се отпечата, че дадения актьор е получил номинация.
// Вход
// •	Име на актьора - текст
// •	Точки от академията - реално число в интервала [2.0... 450.5]
// •	Брой оценяващи n - цяло число в интервала[1… 20]
// На следващите n-на брой реда:
// o	Име на оценяващия - текст
// o	Точки от оценяващия - реално число в интервала [1.0... 50.0]
// Изход
// Да се отпечата на конзолата един ред:
// •	Ако точките са над 1250.5:
// "Congratulations, {име на актьора} got a nominee for leading role with {точки}!"
// •	Ако точките не са достатъчни:
// 	"Sorry, {име на актьора} you need {нужни точки} more!"
// Резултатът да се форматирана до първата цифра след десетичния знак!



function Oscars(input) {
    let actor = input[0];
    let points = Number(input[1]);
    let n = Number(input[2]);
    let total = 0;
    total += points
    let i = 3
    for (i; i <= n + 2; i=i) {
        let judge = input[i];
        let judgePoints = Number(input[i + 1]);
        total += (judge.length * judgePoints) / 2;
        i += 2;
    }
    
    if (total > 1250.5) {
        console.log(`Congratulations, ${actor} got a nominee for leading role with ${total.toFixed(1)}!`);
    }
    if (total <= 1250.5) {
        console.log(`Sorry, ${actor} you need ${(1250.5 - total).toFixed(1)} more!`);
    }

}

Oscars(["Zahari Baharov", "205", "4", "Johnny Depp", "45", "Will Smith", "29", "Jet Lee", "10", "Matthew Mcconaughey", "39"]);