// За да са здрави котките, храненето им трябва да следва определена диета. Напишете програма, която изчислява котешкото процентно разпределение на макроелементите в храната за един ден и пресмята колко средно калории дава един грам от тази храна. Макроелементите са: мазнини, протеини и въглехидрати.
// Разполагате с общия брой калории, които котката трябва да приеме за един ден.
// Известно е, че:
// •	1 грам мазнини = 9 калории
// •	1 грам протеини = 4 калории
// •	1 грам въглехидрати = 4 калории
// За да разберете колко калории дава един грам храна на котката, ще трябва да направите изчисления с реалното тегло на храната, тъй като тя съдържа вода. Трябва да се изчислят грамовете на мазнините, протеините и въглехидратите. Тяхната сума дава общото тегло на храната и от него трябва да извадим процентите вода. 
// Вход:
// От конзолата се прочитат 5 реда:
// •	Процент на мазнините - цяло число в интервала [0…100]
// •	Процент на протеините - цяло число в интервала [0…100]
// •	Процент на въглехидратите - цяло число в интервала [0…100]
// •	Общ брой калории - цяло число в интервала [1000…15000]
// •	Процент на съдържанието на вода - цяло число в интервала [0…100]
// Пояснение: Когато правим подобни изчисления с проценти има голям шанс резултатът да не е цяло число!
// Изход:
// На конзолата се отпечатва 1 ред:
// •	"{calories}"
// Резултатът трябва да бъде форматиран до четвъртия знак след десетичната запетая.
// Примерен вход и изход:
// Вход	Изход	Обяснения
// 60
// 25
// 15
// 2500
// 60	2.4000	(60 % от  2500) / 9 = 166.6 - общите грамове от мазнини
// (25 % от  2500) / 4 = 156.25 - общите грамове от протеини
// (15 % от 2500) / 4 = 93.75 - общите грамове от въглехидрати
//  Теглото на храната = 166.6 + 156.25 + 93.75 = 416.6 грама
//  Калории за един грам храна = 2500 / 416.6 = 6 калории
// 60% от тези 6 калории са вода => остават 100% - 60% = 40 %
//  В един грам от този тип хранене има 
// 40% от 6 = 2.4 калории


// Решение:
function solve(input) {
    let fat = Number(input.shift());
    let protein = Number(input.shift());
    let carbs = Number(input.shift());
    let calories = Number(input.shift());
    let water = Number(input.shift());

    let fatGrams = (fat / 100) * calories / 9;
    let proteinGrams = (protein / 100) * calories / 4;
    let carbsGrams = (carbs / 100) * calories / 4;
    let totalGrams = fatGrams + proteinGrams + carbsGrams;
    let caloriesPerGram = calories / totalGrams;
    let caloriesWithoutWater = caloriesPerGram * (100 - water) / 100;

    console.log(caloriesWithoutWater.toFixed(4));
}

solve(["60",
"25",
"15",
"2500",
"60"])
