// Задача 4. Компютърна фирма
// Фирма за компютри е наела Вас, за да изчислите възможните продажби. Да се напише програма, която за определен вид компютри пресмята средния рейтинг и направените продажби. Първо се въвежда едно число от конзолата, което представлява броя на моделите компютри. След това последователно за всеки от моделите компютри се въвежда по едно число:
// •	Последната цифра (единиците) на това число представлява рейтингът, който е в интервала [2…6].
// •	Останалите цифри (стотици и десетици) са възможните продажби, които ще се осъществят.
// Компютърната продажба се скалира на база рейтинг:
// •	Рейтинг 2 взима 0% от  възможните продажби.
// •	Рейтинг 3 взима 50% от възможните продажби.
// •	Рейтинг 4 взима 70% от възможните продажби.
// •	Рейтинг 5 взима 85% от възможните продажби.
// •	Рейтинг 6 взима 100% от възможните продажби.
// Вход
// От конзолата се прочита:
// На първия ред:
// •	n - брой компютри - цяло число в интервала [1…10]
// На следващите n реда:
// •	Числото, представляващо възможните продажби и рейтинга - цяло число в интервала [32…306]
// Изход
// На конзолата се отпечатват 2 редa:
// •	Броят направени продажби 
// •	Средноаритметичният рейтинг за всички компютри
// Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.
// Примерен вход и изход
// Вход	Изход	Обяснения
// 3
// 103
// 103
// 103	15.00
// 3.00	Брой модели компютри: 3 
// Първи модел:
// •	Рейтинг: 103 - последна цифра 3  3
// •	Възможни продажби: 103 - без последна цифра  10
// •	Осъществени продажби:  50% от продажбите -> 5
// Втори модел:
// •	Рейтинг: 103 - последна цифра 3  3
// •	Възможни продажби: 103 - без последна цифра  10
// •	Осъществени продажби:  50% от продажбите -> 5
// Трети модел:
// •	Рейтинг: 103 - последна цифра 3  3
// •	Възможни продажби: 103 - без последна цифра  10
// •	Осъществени продажби:  50% от продажбите -> 5

// Брой направени продажби: 5 + 5 + 5 = 15 продажби
// Средноаритметичният рейтинг за всички компютри: (3 + 3 + 3) / 3 = 3.00


function computerStore(input) {
    let n = Number(input.shift());
    let totalSales = 0;
    let totalRating = 0;
    for (let i = 0; i < n; i++) {
        let current = Number(input.shift());
        let rating = current % 10;
        let sales = Math.floor(current / 10);
        if (rating === 2) {
            totalSales += 0;
        } else if (rating === 3) {
            totalSales += sales * 0.5;
        } else if (rating === 4) {
            totalSales += sales * 0.7;
        } else if (rating === 5) {
            totalSales += sales * 0.85;
        } else if (rating === 6) {
            totalSales += sales;
        }
        totalRating += rating;
    }
    console.log(totalSales.toFixed(2));
    console.log((totalRating / n).toFixed(2));
}

computerStore(["3",
"103",
"103",
"103"])
