// След успешно класиране, група заминава за  финалното състезание. След представянето си всяка група получава парична награда. Тя зависи от: държавата, в която се е провело състезанието; броя точки, които журито е дало и сезонът, през който се е провело състезанието.    
// •	Ако състезанието се е провело в България паричната награда се изчислява като се умножат точките по броя участниците.
// •	Ако се е провело в чужбина – се умножават броя участници по броя точки и към тях се добавя 50% от получената сума. 
// От получената сума се изваждат разходите посочени в проценти спрямо сезона, през който се е провел:
// 	Лято	Зима
// България	5%	8%
// Чужбина	10%	15%
 



// След завръщането си групата дарява 75% от сумата, след приспаднатите разходи, за благотворителност. Останалата сума се разпределя между членовете на групата.
// Да се  напише програма, която изчислява колко пари са дадени за благотворителност и колко е получил всеки един член на групата. 
// Вход:
// От конзолата се четат 4 реда:
// 1.	Брой танцьори – цяло число в интервала [1 … 10]
// 2.	Брой точки – реално число в интервала [1.00 … 10000.00]
// 3.	Сезон –  текст със следните възможности - "summer" или "winter"
// 4.	Място – текст със следните възможности - "Bulgaria" или "Abroad"
// Изход:
// На конзолата се отпечатват 2 реда:
// •	Сумата, която са дали за благотворителност
// "Charity - {сума за благотворителност}"
// •	Сумата, която е получил всеки танцьор
// "Money per dancer - {сума за танцьор}"
// Сумите да бъдат форматирани до втория знак след десетичната запетая.


function solve(input) {
    let dancers = Number(input.shift());
    let points = Number(input.shift());
    let season = input.shift();
    let place = input.shift();
    let money = 0;
    let charity = 0;
    let moneyPerDancer = 0;

    if (place === "Bulgaria") {
        if (season === "summer") {
            money = dancers * points;
            money *= 0.95;
        } else if (season === "winter") {
            money = dancers * points;
            money *= 0.92;
        }
    } else if (place === "Abroad") {
        if (season === "summer") {
            money = dancers * points;
            money *= 0.90;
            money *= 1.5;
        } else if (season === "winter") {
            money = dancers * points;
            money *= 0.85;
            money *= 1.5;
        }
    }
    charity = money * 0.75;
    moneyPerDancer = (money - charity) / dancers;
    console.log(`Charity - ${charity.toFixed(2)}`);
    console.log(`Money per dancer - ${moneyPerDancer.toFixed(2)}`);
}

solve(["1",
"89.5",
"summer",
"Abroad"])
