# От конзолата се четат 3 реда:
# 1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
# 2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
# 3.	Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]
# Изход
# Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.
# Примерен вход и изход
# Вход	Изход	Обяснения
# 212
# 20
# 2	5	Общо време за четене на книгата: 212 страници / 20 страници за час = 10 часа общо
# Необходимите часове на ден: 10 часа / 2 дни = 5 часа на ден
#
# Вход	Изход
# 432
# 15
# 4	7	Общо време за четене на книгата: 432 страници / 15 страници за час = 28 часа общо
# Необходимите часове на ден: 28 часа / 4 дни = 7 часа на ден


pages = int(input())
pages_per_hour = int(input())
days = int(input())

hours_total = pages / pages_per_hour
days_total = hours_total / days
print(int(days_total))
