// Напишете функция, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
// •	На всеки четен етаж има само офиси
// •	На всеки нечетен етаж има само апартаменти
// •	Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0.
// •	Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0.
// •	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
// Функцията получава масив от две цели числа - броят на етажите и броят на стаите за един етаж. 


function solve(input) {
    let floors = Number(input.shift());
    let rooms = Number(input.shift());

    for (let i = floors; i >= 1; i--) {
        let result = "";
        for (let j = 0; j < rooms; j++) {
            if (i === floors) {
                result += `L${i}${j} `;
            } else if (i % 2 === 0) {
                result += `O${i}${j} `;
            } else {
                result += `A${i}${j} `;
            }
        }
        console.log(result);
    }
}

solve(["6", "4"]);